{
    "tokenize": true,
    "return_dict": true,
    "return_tensors": "pt",
    "max_new_tokens": 120,
    "do_sample": true,
    "temperature": 0.7,
    "top_p": 0.9,
    "repetition_penalty": 1.0,
    "pad_token_id": 50256
}
